app/controllers/cats_controller.rb

  def create
    @cat = Cat.new(cat_params)
    respond_to do |format|
      if @cat.save
---
INSERT INTO "cats" ("name", "colour", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["name", "fsdf"], ["colour", "fsdfs"], ["created_at", 2017-04-11 17:37:24 UTC], ["updated_at", 2017-04-11 17:37:24 UTC], ["user_id", 1]]